tutorial/volCoup-twoWay/flowSolve/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant flowSolve;

modules (AITS);

interfaces
{
  Interface1
  {
    mesh              	flowSolve-Mesh;
    locations		volume;
    patches             (inlet outlet top slip-bottom bottom interface defaultFaces);

    readData
    (
	Temperature
	Rho
    );
    
    writeData
    (
      	Velocity
    );
  };
  Interface2
  {
    mesh                flowSolve-Mesh-volSurf;
    locations           volSurf;
    patches             (inlet outlet top slip-bottom bottom interface defaultFaces);

    readData
    (
    );

    writeData
    (
        Flux
    );
  };
};
